Autodesk.Revit.DB.ReferenceIntersector.SetTargetElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the set of ElementIds to test from in intersection testing.
elementIds:
The target ElementIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.FindNearest(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria.
Remarks:
Note that FindNearest() is a convenience method, and other references that may be nearly the same distance from the origin can be obtained from Autodesk.Revit.DB.ReferenceIntersector.Find(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ).
origin:
The origin of the ray.
direction:
The direction of the ray.
Returns:
The intersected reference nearest to the ray origin, null if none is found
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.Find(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
origin:
The origin of the ray.
direction:
The direction of the ray.
Returns:
A collection containing the intersected references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.ViewId
The id of the 3D view used for evaluation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: viewId is not the id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.
filter:
The element filter.   All references will belong to elements passing this filter.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from any of a set of target elements.
targetElementIds:
The target element ids.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from a single target element only.
targetElementId:
The target element id.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013